Revit 2026 API

# FormArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FormArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
FormArrayIterator()
```
```fsharp
new : unit -> FormArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

FormArrayIterator Class

Autodesk.Revit.DB Namespace